package com.example.dispreapp.consts

/**********************************
ファイル名：適切な行動テキスト定数クラス
 **********************************/
class CorrespondenceActivityTextConst {
    companion object {

        /**************
         *屋内テキスト
         **************/
        /*自宅*/
        const val HOME = "・落下、倒壊の恐れ（食器や棚などのような家具）があるものから離れる。\n" +
                "・頑丈なテーブル机などの下にもぐり、テーブル等の脚を抑える。\n" +
                "・座布団などで頭を保護する。\n" +
                "・可能であれば、戸を開けて出入り口を確保する。\n" +
                "・揺れが収まるまでは、慌てて屋外に飛び出さないようにする。\n" +
                "・歩くときは、落下物や散乱したガラス・蛍光灯の破片などに注意する。 \n" +
                "・家の中を歩くときもヘルメット等で頭を保護し、靴を履くなどする。\n" +
                "・近くにヘルメットや靴がない場合は、鍋やスリッパ等で代用する。\n" +
                "\n電気について \n" +
                "・停電の場合\n" +
                "　避難中に電気が復旧する可能性があり、通電火災を防ぐためブレーカーを切る。 \n" +
                "・停電していない場合\n" +
                "　漏電による火災の可能性があるため、ブレーカーを切る。 "
        /*睡眠中*/
        const val SLEEPING = "・なるべく、倒壊の恐れがあるものは寝室には置かないこと。\n" +
                "・ガラスなどの破損物に注意する。"
        /*入浴中*/
        const val BATHING = "・浴槽の中では、風呂のふたなどをかぶり、頭部を守る。"
        /*台所*/
        const val KITCHEN = "・火を使用している場合は、揺れが収まってから止めに行く\n" +
                "　（調理器具が落ちてきたり、食器棚や冷蔵庫が倒れてくる恐れがあるため）。\n" +
                "・火が消えていてもガスが漏れている場合があるので、ガスの元栓も閉める。"
        /*職場*/
        const val WORKPLACE = "・窓ガラスから離れ、机などの下に隠れる。\n" +
                "・外に逃げる際は、エレベーターは使用せずに、\n" +
                "　落下物に注意しながら非常階段等を利用する。"
        /*エレベーター*/
        const val ELEVATOR = "・全ての階のボタンを押し、最初に停止した階でおりることが原則だが、\n" +
                "　停止した階で慌てておりるのではなく、階の状況を見極めることも大切。\n" +
                "・エレベーターに閉じこめられても、\n" +
                "　焦らず冷静になって「非常用呼び出しボタン」等での連絡を取る努力をする。"

        /**************
         *屋内テキスト
         **************/
        /*住宅街*/
        const val RESIDENTIAL = "・ブロック塀や石塀から離れること。\n" +
                "・自動販売機や電柱、街灯の側には行かないこと。"
        /*オフィス街・繁華街*/
        const val DOWNTOWN = "・窓ガラスが割れて落下してくる可能性がある。\n" +
                "・建物の外壁に取り付けられているタイルや看板が落下してくる可能性もあるため、\n" +
                "　鞄などで頭を保護しながら行動すること。"
        /*海岸*/
        const val COAST = "・津波が脅威となるため、強い揺れを感じたら避難勧告や指示を待たずに高台もしくは\n" +
                "　3階以上（またはその高さに相当する山など）の高いところを目指すこと。\n" +
                "・海水浴中の場合は、監視員やライフセーバーがいる海水浴場では指示に従って\n" +
                "　避難すること。\n" +
                "・戻ってきてはいけない。"
        /*川べり*/
        const val ROVERSIDE = "・流れに沿って上流側へ避難しても津波は追いかけてくるため、\n" +
                "　流れに対して直角方向に素早く避難すること。"
        /*山・丘陵地*/
        const val HILLS = "・落石から身を守ることを心がける。\n" +
                "・地盤がゆるみ、崩れやすくなっている恐れがあるため、\n" +
                "　ガケや急傾斜となっている場所には近づかないようにすること。"
        /*自動車の運転中*/
        const val DRIVING = "・手順\n" +
                "１: 急ブレーキは禁物です。ハンドルをしっかり握り、前後の車に注意しながら徐々にスピードを落とし、道路の左側に停車します。\n" +
                "２: エンジンを切り、揺れがおさまるまでは車外に出ず、カーラジオから情報を入手します。\n" +
                "３: 避難の必要がある場合は、車のキーはつけたままにし、ドアをロックしないで、窓を閉めます。\n" +
                "４: 連絡先を見えるところに書き、車検証などの貴重品を持ち、徒歩で避難します。\n" +
                "・車での避難は、緊急自動車などの妨げになってしまうので避けること。\n" +
                "・高速道路では上記に加え下記も心がける。\n" +
                "　i. ハザードランプを点灯させ、前後の車に注意喚起を行う。\n" +
                "　ii. 約１kmごとに非常口が設けられているので\n" +
                "　　　 そこから徒歩で地上に脱出することができる。"
    }
}